Tekla Open API Reference for Tekla Structures 2025
WpfOkCreateCancel Events
The WpfOkCreateCancel type exposes the following members.
Events
Name | Description
CancelClicked
 The CancelClicked event is raised when the Cancel button is clicked.
CreateClicked
 The ApplyClicked event is raised when the Apply button is clicked.
OkClicked
 The OkClicked event is raised when the Ok button is clicked.
Top
See Also
Reference
WpfOkCreateCancel Class
Tekla.Structures.Dialog.UIControls Namespace